quote-editor/app/controllers/quotes_controller.rb

  def index
    #flash[:notice] = "toglila quando funge."

    @quotes = current_company.quotes.ordered
---
SELECT "quotes".* FROM "quotes" ORDER BY "quotes"."id" DESC

  def create
    # Only this first line changes to make sure the association is created
    @quote = current_company.quotes.build(quote_params)

    if @quote.save
---
INSERT INTO "quotes" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "aaaa"], ["created_at", "2024-07-07 06:44:34.293887"], ["updated_at", "2024-07-07 06:44:34.293887"]]